# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [2]:
dic={
    "first":np.random.randint(low=1, high=4, size=100),
    "second":np.random.randint(low=1, high=3, size=100),
    "third":np.random.randint(low=10000, high=30000, size=100)
}
dic

{'first': array([3, 3, 1, 3, 3, 1, 1, 3, 2, 1, 1, 1, 3, 1, 2, 3, 3, 1, 2, 3, 3, 1,
        2, 2, 2, 2, 3, 3, 1, 2, 1, 2, 3, 2, 3, 1, 3, 1, 3, 3, 1, 1, 3, 3,
        2, 2, 1, 3, 3, 2, 3, 2, 3, 2, 1, 1, 1, 2, 2, 3, 2, 1, 1, 2, 3, 1,
        3, 1, 2, 3, 3, 3, 2, 3, 2, 3, 1, 1, 1, 2, 3, 2, 3, 1, 1, 1, 1, 3,
        3, 1, 2, 2, 1, 2, 3, 2, 3, 1, 1, 3]),
 'second': array([2, 2, 1, 2, 2, 1, 1, 1, 2, 1, 2, 1, 1, 2, 1, 2, 2, 1, 2, 2, 1, 2,
        2, 2, 1, 1, 1, 2, 2, 1, 2, 1, 1, 2, 2, 1, 2, 2, 1, 1, 1, 1, 1, 1,
        1, 1, 2, 1, 2, 1, 1, 1, 2, 1, 1, 1, 2, 2, 2, 2, 2, 2, 1, 1, 2, 1,
        1, 2, 1, 2, 2, 1, 2, 2, 2, 1, 1, 1, 1, 2, 1, 2, 2, 1, 1, 1, 1, 1,
        1, 1, 1, 1, 2, 2, 2, 2, 2, 1, 1, 2]),
 'third': array([17543, 22522, 16363, 14863, 27893, 21194, 15806, 21355, 18175,
        19238, 12062, 29861, 16430, 28895, 17324, 27936, 20345, 27925,
        23823, 26284, 17094, 11722, 15278, 18613, 10386, 23760, 24541,
        24025, 25717, 13132, 18738, 18454, 13033, 22009, 16097, 15552,
        11377, 20684, 22299, 29105, 22870, 13320, 20709, 23937, 19164,
        14158, 15603, 17041, 21615, 26183, 10403, 16691, 27630, 11764,
        22158, 24861, 11615, 11271, 22300, 25662, 12905, 21720, 16938,
        10121, 27022, 16954, 16500, 26888, 19503, 21783, 24762, 24752,
        16827, 24464, 11822, 13519, 16901, 18919, 14745, 15300, 28373,
        13415, 25170, 26135, 27309, 22750, 16757, 24999, 12233, 25839,
        12603, 29355, 21668, 29941, 26084, 18282, 15489, 24252, 27645,
        18823])}

### Step 3. Let's create a DataFrame by joinning the Series by column

In [3]:
df=pd.DataFrame(dic)
df

    first  second  third
0       3       2  17543
1       3       2  22522
2       1       1  16363
3       3       2  14863
4       3       2  27893
..    ...     ...    ...
95      2       2  18282
96      3       2  15489
97      1       1  24252
98      1       1  27645
99      3       2  18823

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [4]:
df = df.rename(columns={'first': 'bedrs','second':'bathrs','third':'price_sqr_meter'})
df

    bedrs  bathrs  price_sqr_meter
0       3       2            17543
1       3       2            22522
2       1       1            16363
3       3       2            14863
4       3       2            27893
..    ...     ...              ...
95      2       2            18282
96      3       2            15489
97      1       1            24252
98      1       1            27645
99      3       2            18823

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [5]:
bigcolumn = pd.concat([df['bedrs'], df['bathrs'], df['price_sqr_meter']], axis=0)
bigcolumn

0         3
1         3
2         1
3         3
4         3
      ...
95    18282
96    15489
97    24252
98    27645
99    18823
Length: 300, dtype: int32

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [8]:
bigcolumn.index
#yes

Int64Index([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9,
            ...
            90, 91, 92, 93, 94, 95, 96, 97, 98, 99],
           dtype='int64', length=300)

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [10]:
bigcolumn.reset_index(drop=True,inplace=True)
bigcolumn

0          3
1          3
2          1
3          3
4          3
       ...
295    18282
296    15489
297    24252
298    27645
299    18823
Length: 300, dtype: int32